@extends('layouts.app')
@section('title', 'design')
@section('content')
    <section class="accordion-direction d-flex flex-column flex-xl-row">
        <div class="accordion" id="accordion">
            <div class="accordion-item">
                <h2 class="accordion-header" id="headingOne">
                    <button class="accordion-button collapsed" type="button" data-bs-toggle="collapse"
                            data-bs-target="#collapseOne" aria-expanded="false" aria-controls="collapseOne">
                        Համալսարաններ
                    </button>
                </h2>
                <div id="collapseOne" class="accordion-collapse collapse" aria-labelledby="headingOne"
                     data-bs-parent="#accordion">
                    <div class="accordion-body">
                        <a href={{url("history")}} class="accordion-text">Պատմություն</a>
                    </div>
                </div>
            </div>

            <div class="accordion-item">
                <h2 class="accordion-header" id="headingTwo">
                    <button class="accordion-button collapsed" type="button" data-bs-toggle="collapse"
                            data-bs-target="#collapseTwo" aria-expanded="false" aria-controls="collapseTwo">
                        Կառուցվածք
                    </button>
                </h2>
                <div id="collapseTwo" class="accordion-collapse collapse" aria-labelledby="headingTwo"
                     data-bs-parent="#accordion">
                    <div class="accordion-body">
                        <a href={{url("/")}}class="accordion-text">Ֆակուլտետներ</a>
                    </div>
                </div>
            </div>
        </div>
        <div class="gallery-wrapper d-flex ">
            <hr>
            @include('components.rich-text')
            <div class="menu_content m-3 p-4 border border-1">
                <div>
                    <h3>
                        Դիզայնի ֆակուլտետ
                    </h3>
                    <p class="mt-3">
                        Մեր Մասին<br>
                        Դիզայն ֆակուլտետի շրջանակներում պատրաստվում են մասնագետներ, որոնք կկարողանան աշխատել դիզայնի հետևյալ
                        ոլորտներում։
                        <br>
                        <strong>
                            Արդյունաբերական դիզայն, գրաֆիկական դիզայն, միջավայրի դիզայն։
                        </strong>
                    </p>
                    <p>
                        Բակալավրի կոչումը ստանալուց հետո ուսանողները ունեն հնարավորություն շարունակելու ուսումը
                        մագիստրատուրայի
                        շրջանակներում ըստ ընտրված մասնագիտացման։ Դասընթացի տևողությունը 2 տարի է, որից հետո երիտասարդ
                        մասնագետը
                        զարգացնում է իր մեջ ինչպես նածագծային, այնպես էլ գիտահետազոտական և վերլուծական ունակությունները։
                        Արդյունքը մարմնավորվում է ավարտական աշխատանքի մեջ, որտեղ հնարամիտ ստեղծագործական առաջարկը
                        ներկայացվում է
                        գիտահետազոտական թևզով և ամրապնդվում է հայեցակարգային նախագծով։ Մենք պատրաստվում ենք մշակել ևս մեկ
                        ուսումնական ծրագիր մագիստրատուրայի շրջանակներում՝ Արթ մենեջմենտ մասնագիտացմամբ։ Շրջանավարտները
                        վստահորեն
                        կզարգացնեն և կիրագործեն արվեստի և դիզայնի բնագավարում մշակույթային իրադարձությունների և
                        ստեղծագործական
                        արդյունքի ներկայացումը սպառողական շուկայում։
                    </p>
                    <div>
                        <div class="gallery d-flex justify-content-center flex-wrap flex-row">
                            <img src="{{asset('images/1.bmp')}}" alt="nuaca">
                            <img src="{{asset('images/2.bmp')}}" alt="nuaca">
                        </div>
                    </div>
                    <h4>
                        Արդյունաբերական Դիզայն
                    </h4>
                    <p>
                        Ուղղություն, որում ընդգրկվում է բազմահազար ամյա պատմություն ունեցող «մարդ-մտածողի» իր շրջապատող
                        նյութական աշխարհը հարմարավետ և գեղեցիկ դարձնելու առաջին փորձից մինչ գերժամանակակից ինովացիոն
                        առաջարկների ձևագոյացման գաղտնիքները: Ընդ որում «դիզայն» տերմինը ունի մի քանի թարգմանություն, որտեղ
                        դիզայները «նախագծող է», «գեղեցիկ նորույթ ստեղծող է» և նույնիսկ «սրամիտ մարդ է»: «Արդյունաբերական
                        դիզայն» մասնագիտացում ստացած շրջանավարտները կնախագծեն «գեղեցիկ նորույթներ» լայն սպեկտրում՝
                        կենցաղային առարկաներ և սարքավորումներ, խաղալիքներ, կահույք, ոչ ստանդարտ դիզայն-օբյեկտներ,
                        շարժամիջոցներ և այլն...
                    </p>
                    <h4>
                        Գրաֆիկական դիզայն
                    </h4>
                    <p>
                        Ուղղություն, որի միջոցով մարդկությանը ներկայացվում է գիտակցաբար կյանքի բազմաթիվ ելևեջների վիզուալ
                        կերպարանքը: Տեղեկություններ՝ պարբերականների ձևավորում, աֆիշներ, պաստառներ, վիզուալ
                        կոմունիկացիաներ:
                    </p>
                    <h4>
                        Ինտերիերի և էքստերիերի դիզայն
                    </h4>
                    <p>
                        Այս ուղղությունը ունի նպատակ դաստիարակելու և զարգացնելու միջավայրի կերպարայնությունը ուժեղացնող,
                        ինչպես նաև միջավայրային էլեմենտների ստեղծելու համար անհրաժեշտ կարողությունները և հմտությունները:
                        Մասնավորապես դիտարկվում են՝ բնակարանների և մենատների դիզայնը, հասարակական օգտագործման օբյեկտների
                        դիզայնը, հանգստի և ռեկրեացիոն գոտիներ, ոչ ստանդարտ կիրառական, դեկորատիվ և լանդշաֆտային էլեմենտների
                        դիզայնը,մասայական միջոցառումների ձևավորումը՝ ոչ կայուն, ծավալային, գույնային, լուսավորության և
                        այլն..., ինչպես նաև էքստերիերային կերպարային էլեմենտների դիզայնը՝ մուտքեր-դռներ, ցուցահանդեսներ,
                        հովանոցներ, ցուցանակներ, բարեկարգում-կանաչապատում և այլն...
                    </p>
                </div>
            </div>
        </div>
    </section>
@endsection
