<?php

namespace App\Http\Controllers;

class ExamsController extends Controller {
    public function qnnutyunner() {

        $this->data = [
            'tab_lists' => [
                [
                    'text' => 'Առկա ուսուցում'
                ],
                [
                    'text' => 'Հեռակա ուսուցում'
                ],
                [
                    'text' => 'Օտարերկրյա դիմորդ'
                ]
            ],
            'tabs' => [
                [
                    'anchor' => 'artasahmanyan',
                    'heading' => 'Արտասահմանյան քաղաքացիների ընդունելություն',
                    'content' => 'ՃՇՀԱՀ-ի օտարերկրյա ուսանողների ընդունելության գործընթացը իրականացվում է 2011թ.-ի ապրիլի 28-ի ՀՀ կրթության և գիտության նախարարության պաշտոնական ծանուցման հիման վրա՝ համաձայն ՀՀ արդարադատության  նախարարության կողմից ընդունված և հաստատված N 700-Ն որոշման, որն է՝ ‹‹Օտարերկրյա ուսանողների ՀՀ բարձրագույն ուսումնական հաստատություններ ընդունելության ընթացակարգ››: Համալսարան կարող են ընդունվել բոլոր անձինք, որոնք ունեն լրիվ միջնակարգ կրթություն և ներկայացնում են պահանջվող փաստաթղթերը:',
                    'lists' => [],
                ],
                [
                    'anchor' => 'naxapatrastakan',
                    'heading' => 'Նախապատրաստական',
                    'content' => 'Արտասահմանյան քաղաքացիների համար համալսարանն անհրաժեշտության դեպքում կազմակերպում է ուսուցում նախապատրաստական խմբերում: Ընդունելությունը անցկացվում է ՀՀ ԿԳՄՍՆ գրությունների հիմքով և հարցազրույցի արդյունքներով: Խմբերի առկայության դեպքում ուսուցումը կարող է կազմակերպվել հայերենով, ռուսերենով, անգլերենով և ֆրանսերենով: Նախապատրաստական խմբերում դասավանդվում են նկարչություն, գծագրություն, մաթեմատիկա, ֆիզիկա, մասնագիտական ներածություն, հայոց լեզու, օտար լեզու առարկաները: Ավարտական քննությունների արդյունքով դիմորդները կարող են ընդունվել համալսարանի բակալավրիատ` համապատասխան մասնագիտություններով: Ուսումնառության ժամկետը մեկ տարի է:',
                    'lists' => [],
                ],
                [
                    'anchor' => 'hh_dimord',
                    'heading' => 'Դիմորդը ՀՀ ԿԳՄՍՆ ներկայացնում է հետևյալ փաստաթղթերը',
                    'lists' => [
                        'Դիմում` դիմում` Հայաստանի Հանրապետության Կրթության, գիտության, մշակույթի և սպորտի նախարարի անունով,',
                        'նախարարության կողմից տրամադրվածդիմում-հարցաթերթիկ` համաձայն ձևի,',
                        'բժշկական տեղեկանք` ընդհանուր առողջական վիճակի մասին (սույն տեղեկանքը կարող է տրված լինել նաև Հայաստանի Հանրապետության բժշկական կազմակերպությունների կողմից),',
                        'անձնագրի պատճեն (նաև նոտարական թարգմանությամբ),',
                        'սփյուռքահայ դիմորդների համար` ծննդյան վկայականի պատճեն` նոտարով վավերացված կամ մկրտության վկայականի պատճեն,',
                        'կրթական աստիճանի վերաբերյալ ավարտական փաստաթղթի պատճենը (գնահատականներով)` թարգմանված և նոտարական, իսկ առանձին երկրների դեպքում` նաև միջազգային վավերացմամբ (ապոստիլ),',
                        '3×4 չափսի 1 լուսանկար',
                        'ինքնակենսագրություն (CV)` հայերենով, ռուսերենով կամ անգլերենով,',
                        'հետբուհական մասնագիտական կրթություն ստանալու համար՝ ընտրած մասնագիտության թեմայով գիտական ռեֆերատ` 20 էջի սահմաններում, հայերենով, ռուսերենով կամ անգլերենով:',
                    ],
                ],
                [
                    'anchor' => 'magistratura',
                    'heading' => 'Մագիստրատուրա',
                    'content' => 'Բակալավրիատում ընդունելությունը կազմակերպվում է.',
                    'lists' => [
                        'արտասահմանյան քաղաքացիների նախապատրաստական խմբերի ավարտական քննությունների արդյունքով,',
                        'ընդհանուր հիմունքներով,',
                        'ՀՀ ԿԳՄՍՆ գրություններով՝ դիմորդների գիտելիքների ստուգման արդյունքով:',
                        'միջկառավարական և միջպետական համաձայնագրերի շրջանակներում,',
                        'ընդհանուր հիմունքներով,',
                        'ՀՀ ԿԳՄՍՆ գրություններով,',
                        'միջբուհական համաձայնագրերի շրջանակներում,',
                    ],
                ],
                [
                    'heading' => '',
                    'content' => '<i> 2022-2023 ուսումնական տարում<br/>
                     համալսարան ընդունվող արտասահմանյան քաղաքացիների համար<br/>
                     սահմանված ուսման տարեկան վարձաչափերն՝ ըստ կրթական աստիճանի, ֆակուլտետների և ուսուցանվող լեզուների
                        </i>',
                ],
                [
                    'heading' => '',
                    'content' => '<strong> <i>
                    Համալսարանի բոլոր ֆակուլտետների հայերենով ուսուցանվող խմբերում ուսման վարձը սահմանված է ՀՀ քաղաքացիների համար սահմանված ուսման վարձաչափերին հավասար:
                        </i></strong>',
                ],
            ],
            'scrolling_texts' => [
                [
                    'id' => '#artasahmanyan',
                    'text' => '<u>Արտասահմանյան քաղաքացիների ընդունելություն</u>',
                ],
                [
                    'id' => '#naxapatrastakan',
                    'text' => '<u>Նախապատրաստական</u>',
                ],
                [
                    'id' => '#hh_dimord',
                    'text' => '<u>Դիմորդը ՀՀ ԿԳՄՍՆ ներկայացնում է հետևյալ փաստաթղթերը</u>',
                ],
                [
                    'id' => '#magistratura',
                    'text' => '<u> Մագիստրատուրա</u>',
                ],
            ],
            'arka' => [
                'tables' => [
                    [
                        'heading' => 'Ճարտարապետություն',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Ճարտարապետություն',
                        'contents' => [
                            'Գծ',
                            'Գծն',
                            'Հլգ(գ)*',
                            '750.000'
                        ]
                    ],
                    [
                        'heading' => 'Դիզայն',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Գրաֆիկական դիզայն',
                        'contents' => [
                            'Գծ',
                            'Գծն',
                            'Հլգ(գ)*',
                            '594.000'
                        ]
                    ],
                    [
                        'heading' => 'Ինտերիեր դիզայն',
                        'contents' => [
                            'Գծ',
                            'Գծն',
                            'Հլգ(գ)*',
                            '594.000'
                        ]
                    ],
                    [
                        'heading' => 'Միջավայրի դիզայն',
                        'contents' => [
                            'Գծ',
                            'Գծն',
                            'Հլգ(գ)*',
                            '594.000'
                        ]
                    ],
                    [
                        'heading' => 'Շինարարական ճարտարագիտություն',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Շենքերի և կառուցվածքների մոդելավորում, նախագծում, շինարարություն',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '492.000'
                        ]
                    ],
                    [
                        'heading' => 'Ինժեներական համակարգերի մոդելավորում, նախագծում, կառավարում',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '492.000'
                        ]
                    ],
                    [
                        'heading' => 'Տրանսպորտային համակարգեր',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '450.000'
                        ]
                    ],
                    [
                        'heading' => 'Գեոմատիկա',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Գեոմատիկա',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '492.000'
                        ]
                    ],
                    [
                        'heading' => 'Գեոդեզիա և կադաստր',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '492.000'
                        ]
                    ],
                    [
                        'heading' => 'Աշխարհագրական տեղեկատվական համակարգեր',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '492.000'
                        ]
                    ],
                    [
                        'heading' => 'Ինֆորմատիկա (համակարգչային գիտություն)',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Ինֆորմատիկա (համակարգչային գիտություն)',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '492.000'
                        ]
                    ],
                    [
                        'heading' => 'Տեղեկատվական համակարգեր',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Տեղեկատվական համակարգեր',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '552.000'
                        ]
                    ],
                    [
                        'heading' => 'Հաշվապահական հաշվառում և հարկում',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Հաշվապահական հաշվառում և հարկում',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '552.000'
                        ]
                    ],
                    [
                        'heading' => 'Զբոսաշրջություն',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Զբոսաշրջություն',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '552.000'
                        ]
                    ],
                    [
                        'heading' => 'Սերվիս',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Սերվիս',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '450.000'
                        ]
                    ],
                    [
                        'heading' => 'Կառավարում',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Լոգիստիկա',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '498.000'
                        ]
                    ],
                ]
            ],
            'heraka' => [
                'tables' => [
                    [
                        'heading' => 'Ճարտարապետություն',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Ճարտարաasdasdպետություն',
                        'contents' => [
                            'Գծ',
                            'Գծն',
                            'Հլգ(գ)*',
                            '750.000'
                        ]
                    ],
                    [
                        'heading' => 'Դիզայն',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Գրաֆիկական դիզայն',
                        'contents' => [
                            'Գծ',
                            'Գծն',
                            'Հլգ(գ)*',
                            '594.000'
                        ]
                    ],
                    [
                        'heading' => 'Ինտերիեր դիզայն',
                        'contents' => [
                            'Գծ',
                            'Գծն',
                            'Հլգ(գ)*',
                            '594.000'
                        ]
                    ],
                    [
                        'heading' => 'Միջավայրի դիզայն',
                        'contents' => [
                            'Գծ',
                            'Գծն',
                            'Հլգ(գ)*',
                            '594.000'
                        ]
                    ],
                    [
                        'heading' => 'Շինարարական ճարտարագիտություն',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Շենքերի և կառուցվածքների մոդելավորում, նախագծում, շինարարություն',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '492.000'
                        ]
                    ],
                    [
                        'heading' => 'Ինժեներական համակարգերի մոդելավորում, նախագծում, կառավարում',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '492.000'
                        ]
                    ],
                    [
                        'heading' => 'Տրանսպորտային համակարգեր',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '450.000'
                        ]
                    ],
                    [
                        'heading' => 'Գեոմատիկա',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Գեոմատիկա',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '492.000'
                        ]
                    ],
                    [
                        'heading' => 'Գեոդեզիա և կադաստր',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '492.000'
                        ]
                    ],
                    [
                        'heading' => 'Աշխարհագրական տեղեկատվական համակարգեր',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '492.000'
                        ]
                    ],
                    [
                        'heading' => 'Ինֆորմատիկա (համակարգչային գիտություն)',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Ինֆորմատիկա (համակարգչային գիտություն)',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '492.000'
                        ]
                    ],
                    [
                        'heading' => 'Տեղեկատվական համակարգեր',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Տեղեկատվական համակարգեր',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '552.000'
                        ]
                    ],
                    [
                        'heading' => 'Հաշվապահական հաշվառում և հարկում',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Հաշվապահական հաշվառում և հարկում',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '552.000'
                        ]
                    ],
                    [
                        'heading' => 'Զբոսաշրջություն',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Զբոսաշրջություն',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '552.000'
                        ]
                    ],
                    [
                        'heading' => 'Սերվիս',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Սերվիս',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '450.000'
                        ]
                    ],
                    [
                        'heading' => 'Կառավարում',
                        'contents' => [
                            '',
                            '',
                            '',
                            ''
                        ]
                    ],
                    [
                        'heading' => 'Լոգիստիկա',
                        'contents' => [
                            'Մ(գ)',
                            'Ֆ(գ)',
                            'Հլգ(գ)*',
                            '498.000'
                        ]
                    ],
                ]
            ],
        ];
        return view('qnnutyunner', ['data' => $this->data]);
    }
}
