<?php

namespace App\Http\Controllers;
class SiteController extends BaseController
{
    public function design()
    {
        $this->data = [
            'accordions' => [
                [
                    'text' => 'Համալսարաններ',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Պատմություն',
                            'link_url' => '/history',
                        ],
                    ]
                ],
                [
                    'text' => 'Կառուցվածք',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Ֆակուլտետներ',
                            'link_url' => '/',
                        ],
                    ]
                ],
            ],
            'heading' => 'Դիզայնի ֆակուլտետ',
            'paragraphs_under_heading' => [
                'Մեր Մասին<br> Դիզայն ֆակուլտետի շրջանակներում պատրաստվում են մասնագետներ, որոնք կկարողանան աշխատել դիզայնի հետևյալ ոլորտներում։<br><strong>Արդյունաբերական դիզայն, գրաֆիկական դիզայն, միջավայրի դիզայն։</strong>',
                'Բակալավրի կոչումը ստանալուց հետո ուսանողները ունեն հնարավորություն շարունակելու ուսումը մագիստրատուրայի շրջանակներում ըստ ընտրված մասնագիտացման։ Դասընթացի տևողությունը 2 տարի է, որից հետո երիտասարդ մասնագետը զարգացնում է իր մեջ ինչպես նածագծային, այնպես էլ գիտահետազոտական և վերլուծական ունակությունները։ Արդյունքը մարմնավորվում է ավարտական աշխատանքի մեջ, որտեղ հնարամիտ ստեղծագործական առաջարկը ներկայացվում է գիտահետազոտական թևզով և ամրապնդվում է հայեցակարգային նախագծով։ Մենք պատրաստվում ենք մշակել ևս մեկ ուսումնական ծրագիր մագիստրատուրայի շրջանակներում՝ Արթ մենեջմենտ մասնագիտացմամբ։ Շրջանավարտները վստահորեն կզարգացնեն և կիրագործեն արվեստի և դիզայնի բնագավարում մշակույթային իրադարձությունների և ստեղծագործական արդյունքի ներկայացումը սպառողական շուկայում։'
            ],
            'images' => [
                "images/student.jpg",
                "images/design.jpg"
            ],
            'second_headings' => [
                [
                    'heading' => 'Արդյունաբերական Դիզայն',
                    'content' => [
                        'Ուղղություն, որում ընդգրկվում է բազմահազար ամյա պատմություն ունեցող «մարդ-մտածողի» իր շրջապատող նյութական աշխարհը հարմարավետ և գեղեցիկ դարձնելու առաջին փորձից մինչ գերժամանակակից ինովացիոն առաջարկների ձևագոյացման գաղտնիքները: Ընդ որում «դիզայն» տերմինը ունի մի քանի թարգմանություն, որտեղ դիզայները «նախագծող է», «գեղեցիկ նորույթ ստեղծող է» և նույնիսկ «սրամիտ մարդ է»: «Արդյունաբերական դիզայն» մասնագիտացում ստացած շրջանավարտները կնախագծեն «գեղեցիկ նորույթներ» լայն սպեկտրում՝ կենցաղային առարկաներ և սարքավորումներ, խաղալիքներ, կահույք, ոչ ստանդարտ դիզայն-օբյեկտներ, շարժամիջոցներ և այլն...'
                    ]
                ],
                [
                    'heading' => 'Գրաֆիկական դիզայն',
                    'content' => [
                        'Ուղղություն, որի միջոցով մարդկությանը ներկայացվում է գիտակցաբար կյանքի բազմաթիվ ելևեջների վիզուալ կերպարանքը: Տեղեկություններ՝ պարբերականների ձևավորում, աֆիշներ, պաստառներ, վիզուալ կոմունիկացիաներ:'
                    ]
                ],
                [
                    'heading' => 'Ինտերիերի և էքստերիերի դիզայն',
                    'content' => [
                        'Այս ուղղությունը ունի նպատակ դաստիարակելու և զարգացնելու միջավայրի կերպարայնությունը ուժեղացնող, ինչպես նաև միջավայրային էլեմենտների ստեղծելու համար անհրաժեշտ կարողությունները և հմտությունները: Մասնավորապես դիտարկվում են՝ բնակարանների և մենատների դիզայնը, հասարակական օգտագործման օբյեկտների դիզայնը, հանգստի և ռեկրեացիոն գոտիներ, ոչ ստանդարտ կիրառական, դեկորատիվ և լանդշաֆտային էլեմենտների դիզայնը,մասայական միջոցառումների ձևավորումը՝ ոչ կայուն, ծավալային, գույնային, լուսավորության և այլն..., ինչպես նաև էքստերիերային կերպարային էլեմենտների դիզայնը՝ մուտքեր-դռներ, ցուցահանդեսներ, հովանոցներ, ցուցանակներ, բարեկարգում-կանաչապատում և այլն...'
                    ]
                ]
            ],
        ];
        return view('design', ['data' => $this->data]);
    }

    public function inchpesDimel()
    {
        $this->data = [
            'accordions' => [
                [
                    'text' => ' Բակալավրիատ',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Ինչպես դիմել',
                            'link_url' => '/inchpes-dimel',
                        ],
                        [
                            'anchor' => 'Քննություն և վարձեր',
                            'link_url' => '/qnnutyunner',
                        ],
                    ]
                ],
                [
                    'text' => 'Մագիստրատուրա',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Ինչպես դիմել',
                            'link_url' => '/inchpes-dimel',
                        ],
                    ]
                ],
                [
                    'text' => 'Ասպիրանտուրա',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Մեր մասին',
                            'link_url' => '/history',
                        ],
                        [
                            'anchor' => 'Հետադարձ կապ',
                            'link_url' => '/hetadardz-kap',
                        ],
                    ]
                ],
            ],
            'heading' => 'ԴԻՄՈՐԴ 2023',
            'paragraphs_under_heading' => [
                'Դիմորդները 2023-2024 ուստարվա առաջին փուլի միասնական և ներբուհական ընդունելության քննություններին
                մասնակցելու համար ընդունելության դիմում-hայտը ներկայացնում են առցանց` Գնահատման և թեստավորման կենտրոնի
                dimord.am կայքում:',
                'Գիտելիքների ստուգման գործընթացն իրականացվում է միասնական մոտեցմամբ. անկախ բուհի կարգավիճակից՝ պետական և
                ոչ պետական հաստատությունների բոլոր դիմորդները` ՀՀ հանրակրթական, նախնական կամ միջին մասնագիտական
                ուսումնական հաստատությունները տվյալ ուսումնական տարում ավարտող և նախորդ տարիների շրջանավարտները,
                օտարերկրացիները, օտարերկրյա պետությունների ուսումնական հաստատությունները տվյալ տարում ավարտող ՀՀ
                քաղաքացիները հանձնում են առավելագույնը 2 միասնական քննություն:',
                '
                Կան մասնագիտություններ, որոնց համար սահմանվել են կամընտրական քննություններ՝ դիմորդներին հնարավորություն
                տալով իրենց ցանկությամբ ընտրել քննական առարկան:',
                ' ՀՀ բուհերում նույն մասնագիտության (կրթական ծրագրի) համար սահմանված են ընդունելության միասնական
                չափանիշներ
                և մուտքային պահանջներ՝ ըստ ՀՀ կառավարության որոշմամբ տվյալ մասնագիտության համար շրջանավարտին շնորհվող
                համապատասխան որակավորման: Ըստ այդմ` նույն մասնագիտության դիմորդները պետք է հանձնեն ընդունելության նույն
                միասնական քննությունները` անկախ ընտրած բուհից:',
                ' ՀՀ կառավարության 26.04.2012թ. N 597-Ն որոշմամբ սահմանված կարգի համաձայն՝ 2023/2024 ուստարվա դիմորդներն
                ընդունելության միասնական քննություններ կարող են հայտագրել և հանձնել 2 անգամ՝',
                '1) Հայաստանի Հանրապետության հանրակրթական, նախնական կամ միջին մասնագիտական ուսումնական հաստատությունների
                տվյալ ուսումնական տարվա կամ նախորդ տարիների շրջանավարտները միասնական քննություններ կարող են հանձնել
                տվյալ տարվա հունվարին և հունիսին,<br>
                2) տվյալ տարվա մինչև հուլիսի 31-ը զորացրվող դիմորդները, օտարերկրացիները, օտարերկրյա պետությունների
                ուսումնական հաստատությունների՝ տվյալ ուսումնական տարվա շրջանավարտ Հայաստանի Հանրապետության քաղաքացիները
                միասնական քննությունները կարող են հանձնել տվյալ տարվա հունվարին և հուլիսին,<br>
                3) Հայաստանի Հանրապետության ուսումնական հաստատությունների տվյալ ուսումնական տարվա և նախորդ տարիների
                շրջանավարտները, օտարերկրացիները, օտարերկրյա պետությունների ուսումնական հաստատությունների տվյալ
                ուսումնական տարվա շրջանավարտ Հայաստանի Հանրապետության քաղաքացիները, որոնց ատեստատում կամ համապատասխան
                ավարտական փաստաթղթում «Հայոց լեզու» առարկան ատեստավորված չէ, և միասնական քննությունները ցանկանում են
                հանձնել ռուսերեն թարգմանությամբ թեստերով (բացառությամբ «Հայոց պատմություն» և օտար լեզուների), միասնական
                քննությունները կարող են հանձնել տվյալ տարվա հունվարին և հուլիսին։<br>',
                'Առաջին փուլում միասնական քննությունների հայտագրումը Հայաստանի Հանրապետության հանրակրթական, նախնական կամ
                միջին մասնագիտական ուսումնական հաստատությունները տվյալ ուսումնական տարում ավարտող և նախորդ տարիների
                շրջանավարտ դիմորդների, օտարերկրացիների, օտարերկրյա պետությունների ուսումնական հաստատությունների տվյալ
                ուսումնական տարվա շրջանավարտ Հայաստանի Հանրապետության քաղաքացիների կողմից դիմումների կիրականացվի 2022
                թվականի դեկտեմբերի 15-ից մինչև դեկտեմբերի 25-ը:',
                '<strong>
                    Միասնական քննությունները կանցկացվեն 2023 թվականի հունվարի 15-ից մինչև փետրվարի 15-ը:
                </strong>',
                'Երկրորդ փուլում միասնական քննությունների հայտագրումը, ինչպես նաև մասնագիտության առաջին փուլի հայտագրումը
                Հայաստանի Հանրապետության հանրակրթական, նախնական կամ միջին մասնագիտական ուսումնական հաստատությունները
                տվյալ ուսումնական տարում ավարտող և նախորդ տարիների շրջանավարտ դիմորդների կողմից Երկրորդ փուլում հայտերն
                ընդունվելու են կիրականացվի 2023 թվականի ապրիլի 15-ից մինչև մայիսի 10-ը ընկած ժամանակահատվածում:',
                'Առաջին փուլում /հունվար-փետրվար ամիսներին անցկացվող/ դիմում-հայտ լրացնելուց առաջ դիմորդները ԳԹԿ-ի
                համապատասխան հաշվեհամարին յուրաքանչյուր միասնական քննության համար փոխանցում են 4500 դրամ, իսկ
                դիմում-հայտը լրացնելուց հետո ԳԹԿ-ին են փոխանցում յուրաքանչյուր քննությանը մասնակցելու համար ԳԹԿ-ի
                համապատասխան հաշվեհամարին փոխանցված 4500 դրամ վճարի անդորրագրի էլեկտրոնային տարբերակը:',
                'Ընդունելության քննությունների հիմնական փուլի մրցույթի արդյունքների հաստատվելուց հետո, բուհերում թափուր
                տեղերի առկայության դեպքում, ընդունելության քննություններից դրական միավոր (միավորներ) ստացած, սակայն
                մրցույթից դուրս մնացած դիմորդները հուլիսի 19-26-ը մինչև 18:00-ն ընկած ժամանակահատվածում կարող են
                մասնակցել լրացուցիչ՝ թափուր տեղերի մրցույթին՝ առցանց եղանակով լրացնելով դիմում-հայտ:',
                '<strong>
                Հանրապետական ընդունող հանձնաժողովը բուհերում լրացուցիչ՝ թափուր տեղերի մրցույթի արդյունքները
                հաստատում է հուլիսի 30-ին:
            </strong>',
            ]
        ];
        return view('inchpes-dimel', ['data' => $this->data]);
    }

    public function history()
    {
        $this->data = [
            "heading" => 'Պատմություն',
            'accordions' => [
                [
                    'text' => 'Համալսարաններ',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Պատմություն',
                            'link_url' => '/history',
                        ],
                    ]
                ],
                [
                    'text' => 'Կառուցվածք',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Ֆակուլտետներ',
                            'link_url' => '/',
                        ],
                    ]
                ],
            ],
            'paragraphs_under_heading' => [
                ' <strong>1921 թ. հոկտեմբեր</strong> – Երևանի նորաստեղծ համալսարանում սկսեց գործել տեխնիկական ֆակուլտետը՝
                հանրապետությունում ճարտարապետների ու շինարարների պատրաստման առաջնեկը՝ ինժեներաճարտարապետական և
                ինժեներահիդրոտեխնիկական մասնագիտություններով ու 38 ուսանողներով: 1920-ական թթ. տեխնիկական ֆակուլտետում
                կադրերի պատրաստման գործընթացը նպատակաուղղված էր ժամանակի համար արդիական սոցիալ-տնտեսական խնդիրների
                լուծմանը: Նորաստեղծ ֆակուլտետում դասախոսական աշխատանքի հրավիրված, Ռուսաստանի և Եվրոպայի մշակույթին
                հաղորդակից հայ մտավորականության շարքում էին ճարտարապետներ Ալեքսանդր Թամանյանը, Հովհաննես Քաջազնունին,
                Նիկողայոս Բունիաթյանը, ջրաշինարար Գրիգոր Շիրմազանյանը, բազմաթիվ անվանի գիտնականներ ու դասախոսներ, նրանց
                թվում՝ <strong>Ալեքսանդր Հակոբյանը, Հարություն Զաքյանը, Հովհաննես Նավակատիկյանը, Զեբեթ Խոջանեթյանը, Արշակ Տոնյանը, Լևոն Մանուչարյանը, Լևոն Ռոտինյանը, Կիրյակ Զավրիևը, Գուրգեն Օգանեզովը, Աշոտ Տեր-Մկրտչյանը, Միքայել Վարունցյանը, Անդրեյ Գասպարյանը, Տիգրան Ջրբաշյանը, Ֆրեյդոն Աղալյանը, Հակոբ Կոջոյանը, Միքայել Մազմանյանը և Արա Սարգսյանը:</strong>',
                'Իր 100-ամյա գոյության ընթացքում ճարտարապետաշինարարական կրթօջախը պատրաստել է 30 000-ից ավելի մասնագիտական
                կադրեր, որոնք կերտել են մեր հայրենիքի նոր դիմագիծը:',
                ' <strong>1927 թ.</strong> – ինժեներաճարտարապետական մասնագիտությունը վերանվանվեց «քաղաքացիական
                շինարարություն», իսկ
                ինժեներահիդրոտեխնիկականը՝ «ճանապարհների և հիդրոտեխնիկական կառուցվածքների շինարարություն»:',
                '<strong>1928 թ.</strong> – տեխնիկական ֆակուլտետը տվեց իր առաջին յոթ շրջանավարտները: 1928-1930 թթ.
                տեխնիկական ֆակուլտետն ավարտած առաջին շրջանավարտներին գործունեության լայն ասպարեզ էր սպասվում: Նրանք
                բոլորն էլ դարձան հայ նոր ճարտարապետության և շինարվեստի հաստատման գործի նվիրյալներ՝ դնելով նոր Հայաստանի
                ամրակառույց հիմքերը:',
                ' <strong>1930 թ.</strong> – տեխնիկական ֆակուլտետի հիմքի վրա ստեղծվեց ՀԽՍՀ շինարարական ինստիտուտը, որի
                անդրանիկի տնօրենը դարձավ Միքայել Մազմանյանը:',
                '<strong>1931-1932 թ.</strong> – ինստիտուտն ունեցել է 465 ուսանող, որից 63 %-ն ապահովվել է կրթաթոշակով:',
                ' <strong>1933 թ.</strong> – ՀԽՍՀ շինարարական և քիմիատեխնոլոգիական ինստիտուտների միավորմամբ հիմնադրվեց
                Երևանի պոլիտեխնիկական ինստիտուտը՝ երկու ֆակուլտետներով՝ շինարարական ու քիմիատեխնոլոգիական: Կ. Մարքսի
                մահվան 50-ամյակի կապակցությամբ ինստիտուտը կոչվեց նրա անվամբ: Ինստիտուտի տնօրեն նշանակվեց Միքայել
                Մազմանյանը:',
                '  <strong>1936թ.</strong> – ինստիտուտի տնօրեն նշանակվեց մասնագիտությամբ ինժեներ-ճարտարապետ Համազասպ
                Ղանթաղչյանը:',
                '<strong>1937 թ.</strong> – ինստիտուտում դադարեցվեց ինժեներ-ճարտարապետի մասնագիտությամբ կադրերի
                պատրաստումը, որը վերսկսվեց 1943-1944 ուստարում:',
                '  <strong>1938 թ.</strong> – շինարարության ֆակուլտետը բաժանվեց երկու առանձին ֆակուլտետների՝ շինարարական և
                հիդրոտեխնիկական, որոնք 1939 թ. վերամիավորվեցին, և կազմակերպվեց շինարարական ֆակուլտետ՝ երկու
                մասնագիտությամբ՝ «արդյունաբերական և քաղաքացիական շինարարություն», «հիդրոտեխնիկական շինարարություն»:',
                '<strong>1939 թ.</strong> – շինարարական ֆակուլտետում ձևավորվեց երկու մասնագիտություն՝ «արդյունաբերական և
                քաղաքացիական շինարարություն» ու «հիդրոտեխնիկական շինարարություն»:',
                '  <strong>1959 թ.</strong> – շինարարական ֆակուլտետում կար 6 մասնագիտություն՝ «արդյունաբերական և
                քաղաքացիական շինարարություն», «ճարտարապետություն», «հիդրոտեխնիկական շինարարություն», «ավտոմոբիլային
                ճանապարհներ», «ջրամատակարարում և կոյուղի», «ջերմագազամատակարարում»:',
                ' <strong>1972 թ.</strong> – սկսեց գործել ճարտարապետական-շինարարական մասնագիտությունների գծով թեկնածուական
                ատենախոսությունների պաշտպանության մասնագիտական խորհուրդը:',
                '<strong>2014 թ. հունվար</strong> – Երևանի ճարտարապետության և շինարարության պետական համալսարանը
                վերանվանվեց Ճարտարապետության և շինարարության Հայաստանի ազգային համալսարան:',
                '<strong>2016թ.</strong> – նշվեց ճարտարապետության և շինարարության Հայաստանի ազգային համալսարանի 95-ամյա
                հոբելյանը, որին մասնակցեցին հանրապետության բուհերի ներկայացուցիչները, ԱՊՀ երկրների պատվիրակներ, հյուրեր
                ԱՄՆ-ից, Կանադայից, Ֆրանսիայից, Իտալիայից և այլ երկրներից:',
                '<strong>2019թ.</strong> – ՃՇՀԱՀ հոգաբարձուների խորհուրդը ռեկտորի ժամանակավոր պաշտոնակատար ընտրեց
                տեխնիկական գիտությունների դոկտոր, պրոֆեսոր Եղիազար Վարդանյանին։',
                '  <strong>2020 թ.</strong> – հոգաբարձունների խորհրդի նիստում Ճարտարապետության և շինարարության Հայաստանի
                ազգային համալսարանի ռեկտոր ընտրվեց տեխնիկական գիտությունների դոկտոր, պրոֆեսոր Եղիազար Վարդանյանը։',
                ' <strong>2021 թ.</strong> – Կայացավ «Պատմամշակութային ժառանգության պահպանությունը՝ որպես պետությունների
                միջև արդյունավետ երկխոսության միջոց» խորագրով միջազգային գիտաժողովը, որին մասնակցեց Ռուսաստանից,
                Ղազախստանից, Բելգիայից, Իտալիայից, Իսպանիայից, Ֆրանսիայից և մի շարք այլ երկրներից 65 ճարտարապետ
                գիտնական:',
                '<strong>2022 թ.</strong> – Հոգաբարձուների խորհրդի նախագահ ընտրվեց Քաղաքաշինության կոմիտեի նախագահ Արմեն
                Ղուլարյանը, իսկ քարտուղար՝ համալսարանի հայցորդ Խաչատուր Խաչատրյանը:'
            ],
        ];
        return view('history', ['data' => $this->data]);
    }

    public function dimord()
    {
        $this->data = [
            'heading' => 'ԸՆԴՈՒՆԵԼՈՒԹՅԱՆ ԴԻՄՈՒՄ-ՀԱՅՏԵՐԻ ՀԱՅՏԱԳՐՈՒՄԸ ԿԻՐԱԿԱՆԱՑՎԻ ՄԻՆՉԵՎ ՄԱՅԻՍԻ 10-Ը ՆԵՐԱՌՅԱԼ',
            'accordions' => [
                [
                    'text' => ' Բակալավրիատ',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Ինչպես դիմել',
                            'link_url' => '/inchpes-dimel',
                        ],
                        [
                            'anchor' => 'Քննություն և վարձեր',
                            'link_url' => '/qnnutyunner',
                        ],
                    ]
                ],
                [
                    'text' => 'Մագիստրատուրա',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Ինչպես դիմել',
                            'link_url' => '/inchpes-dimel',
                        ],
                    ]
                ],
                [
                    'text' => 'Ասպիրանտուրա',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Մեր մասին',
                            'link_url' => '/history',
                        ],
                        [
                            'anchor' => 'Հետադարձ կապ',
                            'link_url' => '/hetadardz-kap',
                        ],
                    ]
                ],
            ],
            'paragraphs_under_heading' => [
                'Սիրելի դիմորդ,<br>
                    2022-2023 ուսումնական տարվա ընդունելության դիմում-հայտերի հայտագրումը կիրականացվի մինչև մայիսի 10-ը ժամը
                    18:00:<br>
                    Բարձրագույն ուսումնական հաստատությունների ընդունելության մրցույթն անցկացվում է երկու փուլով՝ հիմնական (2
                    փուլով) և լրացուցիչ:',
            ],
            'lists' => [
                [
                    'italic' => 'I փուլ',
                    'content' => [
                        'Առաջին փուլի հայտագրումը տեղի է ունենում ապրիլի 15-ից մայիսի 10-ը ներառյալ` մինչև ժամը 18:00:',
                        'Այս փուլում ընդունելությունն անցկացվում է «1 բուհ-1 մասնագիտություն» (անվճար և վճարովի տեղերի համար) կանոնով:',
                        'Առցանց ընդունելության դիմում-հայտերը ընդունվում են am կայքով:',
                        'Էլեկտրոնային տարբերակով դիմում-հայտը լրացնելու համար դիմորդը իր դպրոցից ստանում է յուրաքանչյուր դիմորդին տրվող անհատական ծածկագիրը:',
                        'Նախորդ տարիների, նախնական կամ միջին մասնագիտական ուսումնական հաստատությունների շրջանավարտներին ընդունելության դիմում-հայտերի լրացման համար ԳԹԿ անձնական համար է տրամադրվում իրենց բնակության վայրին մոտ գտնվող և այդ նպատակով առանձնացված դպրոցից:'
                    ],
                ],
                [
                    'italic' => 'II փուլ',
                    'content' => [
                        'երկրորդ փուլի հայտագրումը տեղի է ունենում հունիսի 26-ից հուլիսի 1-ը ներառյալ` մինչև ժամը 17:00:',
                        'Ընդունելության երկրորդ փուլին կարող են մասնակցել օտարերկրացիները, օտարերկրյա պետությունների ուսումնական հաստատությունները տվյալ ուսումնական տարում ավարտած ՀՀ քաղաքացիները, տվյալ տարվա ամառային զորակոչից զորացրված կամ մինչև հուլիսի 31-ը զորացրվող դիմորդները:',
                        'ԱԱյս փուլում ընդունելությունն անցկացվում է «1 բուհ-1 մասնագիտություն» (անվճար և վճարովի տեղերի համար) կանոնով:',
                        'Առցանց ընդունելության դիմում-հայտերը ընդունվում են am կայքով:',
                        'Էլեկտրոնային տարբերակով դիմում-հայտը լրացնելու համար դիմորդը իր բնակության վայրին մոտ գտնվող և ԳԹԿ-ի կողմից առանձնացված դպրոցից ստանում է յուրաքանչյուր դիմորդին տրվող անհատական ծածկագիրը:',
                        'Մինչև հուլիսի 31-ը զորացրվող զինծառայողները կարող են մասնակցել ընդունելության մրցույթին նախքան զորակոչվելը ստացած միասնական քննությունների վկայագրերով:'
                    ],
                ],
                [
                    'italic' => 'Լրացուցիչ փուլ',
                    'content' => [
                        'Լրացուցիչ փուլի հայտագրումը տեղի է ունենալու հուլիսի 19-26-ը մինչև 18:00:',
                        'Այս փուլին կարող են մասնակցել ընդունելության քննություններից դրական միավորներ ստացած, սակայն մրցույթից դուրս մնացած դիմորդները, Հանրապետական ընդունող հանձնաժողովի կողմից ընդունելության քննությունների հիմնական փուլի մրցույթի արդյունքները հաստատվելուց հետո, բուհերում թափուր տեղերի առկայության դեպքում` առցանց եղանակով լրացնելով դիմում-հայտ:',
                        'Այս փուլում ընդունելությունն անցկացվում է «1 բուհ-1 մասնագիտություն» (անվճար և վճարովի տեղերի համար) կանոնով:',
                    ],
                    'strong' => "Հանրապետական ընդունող հանձնաժողովը բուհերում լրացուցիչ՝ թափուր տեղերի մրցույթի արդյունքները հաստատում է հուլիսի 30-ին:"
                ],
            ],
        ];
        return view('dimord', ['data' => $this->data]);
    }

    public function architecture()
    {
        $this->data = [
            'heading' => 'Ճարտարապետության ֆակուլտետ',
            'accordions' => [
                [
                    'text' => 'Համալսարաններ',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Պատմություն',
                            'link_url' => '/history',
                        ],
                    ]
                ],
                [
                    'text' => 'Կառուցվածք',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Ֆակուլտետներ',
                            'link_url' => '/',
                        ],
                    ]
                ],
            ],
            'paragraphs_under_heading' => [
                'Ճարտարապետական մասնագիտական կրթությունը Հայաստանում սկիզբ է առել 1921 թվականին։
                1933թ. պոլիտեխնիկական ինստիտուտի կազմավորման ժամանակ, վերջինիս շինարարական ֆակուլտետում ճարտարապետական
                բաժնի ձևավորմամբ, 1936 թվականին ականավոր ճարտարապետ Նիկողայոս Բունիաթյանի ջանքերով կազմավորվեց
                ճարտարապետության մասնագիտական ամբիոնը, որը նա ղեկավարեց մինչև 1938 թվականը։ Այնուհետև՝ մինչև 1944
                թվականը, ամբիոնը ղեկավարեց <strong>Հարություն Զաքյանը:</strong>',
                'Տարբեր տարիներին Ճարտարապետության ֆակուլտետի դեկաններ են եղել <strong>Արշավիրի Շավարշյանը, Ռոբերտ Սուրենի
                 Ավետիսյանը, Արմեն Ֆրեյդունի Աղալյանը։</strong>',
                ' ՀՀ կառավարության 1989 թ. հուլիսի 11-ի որոշմամբ Պոլիտեխնիկական ինստիտուտի վերակազմավորման արդյունքում
                <strong>ճարտարապետության և շինարարության ֆակուլտետները առանձնացան՝ դառնալով Երևանի
                    Ճարտարապետաշինարարական
                    ինստիտուտ:</strong>',
                ' 2000 թվականի հուլիսի 7-ին, ՀՀ կառավարության որոշմամբ, Երևանի Ճարտարապետաշինարարական ինստիտուտը
                վերանվանցվեց Երևանի Ճարտարապետության և շինարարության պետական համալսարանի, իսկ 2014 թվականի հունվարին,
                բուհը վերանվանվեց Ճարտարապետության և շինարարության Հայաստանի ազգային համալսարան:',
                'Ֆակուլտետը բաղկացած է հինգ ամբիոններից, որոնցից <strong> մասնագիտական ամբիոններն են՝</strong>',
            ],
            'lists' => [
                [
                    'italic' => '',
                    'content' => [
                        'Ճարտարապետության տեսության, պատմաճարտարապետական ժառանգության վերականգնման և վերակառուցման, գեղեցիկ
                    արվեստի և պատմության ամբիոն, (ամբիոնի վարիչներ են եղել՝ Վարազդատ Մարտիրոսի Հարությունյանը (1945-1990
                    թթ.), Արշավիր Խորենի Թորամանյանը (1991-1993 թթ.), Յուրի Աշոտի Սաֆարյանը (1994-2014 թթ.))',
                        'Ճարտարապետական նախագծման և ճարտարապետական միջավայրի դիզայնի ամբիոն, (ամբիոնի վարիչներ են եղել՝ Յան
                    Իսահակյանը (1991-1997 թթ.), ՀՀ վաստակավոր ճարտարապետ, պրոֆեսոր Գարրի Հայկի Ռաշիդյանը (1997-2015
                    թթ.))',
                        'Քաղաքաշինության ամբիոն (ամբիոնի վարիչներ են եղել՝ Արծվին Հայկի Գրիգորյանը (1992-2008 թթ.) Սիրեկան
                    Բորիսի Օհանյանը (2009-2015 թթ.))',
                    ],
                ],
            ],
            'secondary_paragraphs' => [
                'Ֆակուլտետի առաքելությունն է եռաստիճան կրթական համակարգով՝ միջազգային չափանիշներին, ներքին և արտաքին
                աշխատաշուկայի պահանջներին համապատասխան, մասնագետների պատրաստումը, գիտահետազոտական աշխատանքների
                իրականացումը, շարունակական կրթության ապահովումը և ճարտարապետական կրթությանը նպաստող ծառայությունների
                մատուցումը:',
                '1996 թվականից մինչ մեր օրերը, Ճարտարապետության ֆակուլտետի ավարտական դիպլոմը Ֆրանսիայի կառավարության
                հատուկ հանձնաժողովի կողմից ճանաչված է իրենց դիպլոմին համարժեք։',
                'Ճարտարապետության ֆակուլտետը պահպանում և զարգացնում է իր ավանդական կապերը ինչպես նախկին՝ Խորհրդային
                երկրի, այնպես էլ Եվրոպական (Ֆրանսիայի, Գերմանիայի, Իտալիայի, Իսպանիայի, Լեհաստան և այլն) երկրների ինչպես
                նաև Չինաստանի, Պարսկաստանի և այլ երկերների ճարտարապետական դպրոցների հետ։ Ֆակուլտետի ուսանողները
                համագործակցության շրջանակներում մասնակցում են միջազգային ստուգատեսների, սեմինարների, ուսանողական
                պրակտիկաների՝ մշտապես արձանագրելով բարձր արդյունքներ։'
            ],
        ];
        return view('architecture', ['data' => $this->data]);
    }

    public function shinararutyun()
    {
        $this->data = [
            'heading' => 'Շինարարության ֆակուլտետ',
            'accordions' => [
                [
                    'text' => 'Համալսարաններ',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Պատմություն',
                            'link_url' => '/history',
                        ],
                    ]
                ],
                [
                    'text' => 'Կառուցվածք',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Ֆակուլտետներ',
                            'link_url' => '/',
                        ],
                    ]
                ],
            ],
            'paragraphs_under_heading' => [
                'Շինարարության ֆակուլտետը ՃՇՀԱՀ առանցքային ֆակուլտետներից է: 1921-1930 թթ. Երևանի պետական համալսարանի
                տեխնիկական ֆակուլտետը, որից սկիզբ է առնում շինարարական մասնագիտությունը, մասնավորապես
                ճարտարագիտաշինարարականը, գլխավորում էին դեկաններ Դավիթ Զավրիկյանը (1921-1922 թթ.), Գրիգոր Շիրմազանյանը
                 (1922-1923 թթ.), Զեբեթ Խոջանեթյանը (1924 թ. հունվարից մինչև սեպտեմբեր), Նիկողայոս Բունիաթյանը (1924-1925
                թթ.), Արշակ Տոնյանը (1925 -1929 թթ.), Հովհաննես Նավակատիկյանը (1929-1930 թթ.):',
                '1930 թ. հուլիսի 16-ից Շինարարական ինստիտուտի տնօրեն նշանակվեց Միքայել Մազմանյանը: 1931 թ. հունվարից
                Ճարտարապետաշինարարական ֆակուլտետի դեկան նշանակվեց Հարություն Զաքյանը, Հիդրոտեխնիկական ֆակուլտետի դեկան՝
                Աշոտ Մելիքջանյանը (1938 թ.), իսկ 1933 թվականից Շինարարական ֆակուլտետը գործում էր իր ստեղծած բազայի հիման
                վրա Պոլիտեխնիկական ինստիտուտի կազմում: Հաջորդ տարիներին՝ 1932 թվականից մինչև 1937 թվականը, Շինարարության
                ֆակուլտետի դեկան նշանակվեցին Նիկոլայ Վլասյանը, Եղիշե Համբարձումյանը, Գուրգեն Օգանեզովը, Հարություն
                Զաքյանը, Թորգոմ Խաչատրյանը: 1936/1937 թթ. ուստարում «Արդյունաբերական և քաղացիական շինարարություն»
                մասնագիտության հետ մեկտեղ Շինարարական ֆակուլտետի կազմում վերականգնվեց «Հիդրոտեխնիկական շինարարություն»
                մասնագիտությունը: 1938 թ. վերակազմավորումից հետո Շինարարության ֆակուլտետի դեկան է նշանակվել Վարազդատ
                Հարությունյանը, իսկ Հիդրոտեխնիկական ֆակուլտետի դեկան՝ Գուրգեն Արարկցյանը (1939 թ. և 1943-1944 թթ.): 1939
                թ. նոյեմբերից այդ երկու ֆակուլտետի հերթական միավորումից հետո Շինարարական ֆակուլտետի դեկան է նշանակվել
                Ավետիք Տեր-Իսրայելյանը,',
                '1972 թ. Շինարարական ֆակուլտետի բազայի վրա կրկին ստեղծվեց Ճարտարապետաշինարարական ֆակուլտետը, որն
                ընդգրկվում էր «Ճարտարապետություն», «Արդյունաբերական և քաղացիական շինարարություն», «Շինարարական իրերի և
                կոնստրուկցիաների արտադրություն», «Էկոնոմիկա և շինարարական կազմակերպություն» մասնագիտությունները և
                ինժեներաշինարարական ֆակուլտետը, որն իր հերթին ներառում էր «ՀԷԿ-ի և ջրային կառույցների հիդրոտեխնիկական
                շինարարություն», «Ջերմագազամատակարարում և օդափոխություն, կոյուղի և ջրամատակարարում, կամուրջներ և
                թունելներ, ավտոմոբիլային ճանապարհներ» մասնագիտությունները: Ճարտարապետաշինարարական ֆակուլտետի դեկան է
                ընտրվել Գուրգեն Աբովյանը, իսկ ինժեներաշինարարական ֆակուլտետի դեկան՝ Մարտունի Պողոսյանը: 1980 թվականից
                մինչև 2013 թվականը ֆակուլտետը գլխավորել են Գուրգեն Աբովյանը, Արմեն Աղալյանը, Ռոբերտ Ավետիսյանը, Հրանտ
                Պողոսյանը, Հրանտ Խաչիկյանը (1974-1984 թթ.), Վլադիմիր Հակոբյանը, Ալբերտ Մարգարյանը, Ռազմիկ Փետեոտյանը:',
                'Բացի վերը նշված ֆակուլտետներից՝ դրանց հետ միասին տարբեր ժամանակներում գործում էին ֆակուլտետներ՝
                Ավտոճանապարհային (դեկան՝ Էմանուել Խուդաբաշյան, 1938 թ.), Երեկոյան շինարարական (դեկան՝ Գևորգ Հակոբյան,
                1956-1977 թթ.), Հեռակա շինարարական (դեկան՝ Ռուդոլֆ Եփրեմյան, 1989 -1990 թթ., 1996-2013 թթ.),
                Շինարարության տեխնոլոգիայի (դեկան՝ Ալբերտ Ասիրյան, 1993-2010 թթ.), Տրանսպորտային շինարարության (դեկան՝
                Ռոբերտ Ազոյանը, 1993-2011թթ.):',
                ' <strong>Շինարարության ֆակուլտետում ներառված են հետևյալ մասնագիտությունները (կրթական ծրագրերը)՝
                    բակալավրիատում՝</strong>',
            ],
            'lists' => [
                [
                    'italic' => '',
                    'content' => [
                        '<span class="test">Շինարարական ճարտարագիտություն.</span>',
                        '<span class="test">Արդյունաբերական և քաղաքացիական շինարարություն և կոնստրուկցիաների նախագծում,</span>',
                        '<span class="test">Շինանյութերի, կառույցների ճարտարագիտություն և տեխնիկական փորձաքննություն,</span>',
                        '<span class="test">Անշարժ գույքի և շինարարության կառավարում,</span>',
                        '<span class="test">Շենքերի նախագծում (միայն առկա ուսուցում),</span>',
                        '<span class="test">Ավտոճանապարհներ, կամուրջներ, թունելներ,</span>',
                        '<span class="test">Հիդրոտեխնիկական և հիդրոէներգետիկ կառուցվածքներ,</span>',
                        '<span class="test">Գեոմատիկա.</span>',
                    ]
                ],
                [
                    'italic' => '<strong>Մագիստրատուրայում՝</strong>',
                    'content' => [
                        '<span class="test">Շինարարական ճարտարագիտություն.</span>',
                        '<i><strong>Արդյունաբերական և քաղաքացիական շինարարություն և կոնստրուկցիաների նախագծում,</strong></i>',
                        '<span class="test">Շինանյութերի, կառույցների ճարտարագիտություն և տեխնիկական փորձաքննություն,</span>',
                        '<i><strong>Ջրամատակարարման և ջրահեռացման համակարգերի նախագծում, շինարարություն,</strong></i>',
                        '<i><strong>Ավտոճանապարհներ, կամուրջներ, թունելներ,</strong></i>',
                        '<i><strong>Հիդրոտեխնիկական և հիդրոէներգետիկ կառուցվածքներ,</strong></i>',
                        '<span class="test">Գեոմատիկա և կադաստր,</span>',
                        '<span class="test">Գեոդեզիա.</span>'
                    ]
                ],
                [
                    'italic' => '<strong>Այժմ ֆակուլտետի կազմում ընդգրկված են հետևյալ ամբիոնները՝ իրենց լաբորատորիաներով՝</strong>',
                    'content' => [
                        '<span class="test">Շինարարական կոնստրուկցիաների ամբիոն,</span>',
                        '<i><strong>Շինարարական կոնստրուկցիների լաբորատորիա,</strong></i>',
                        '<span class="test">Շինարարական արտադրության տեխնոլոգիայի և կազմակերպման ամբիոն,</span>',
                        '<span class="test">Շինարարական նյութերի, պատրաստվածքների և կոնստրուկցիաների արտադրության ամբիոն,</span>',
                        '<span class="test">Շինարարական նյութերի և պատրաստվածքների ուսումնագիտափորձարարական լաբորատորիա,</span>',
                        '<i><strong>Շինարարական մեխանիկայի ամբիոն,</strong></i>',
                        '<i><strong>Ինժեներական գեոդեզիայի ամբիոնի մասնագիտացված լսարան,</strong></i>',
                        '<i><strong>ԻՏեսական մեխանիկայի և նյութերի դիմադրության ամբիոն,</strong></i>',
                        '<span class="test">Նյութերի դիմադրության լաբորատորիա:</span>',
                    ]
                ],
            ],
            'secondary_paragraph' => [
                ' 1921 թվականից սկսած՝ Շինարարական ֆակուլտետի շրջանավարտների թիվըգերազանցում է 2000-ը: Շինարարության
                ֆակուլտետի շրջանավարտները ակտիվ մասնակցություն են ցուցաբերում ջրամբարների, ջրագծերի, պատնեշների,
                մետրոյի, կամուրջների և թունելների, ճանապարհների, քաղաքացիական և արդյունաբերական շենքերի, ՀԷԿ-երի,
                ՋԷԿ-երի, ԱԷԿ-ի և այլ յուրօրինակ շինությունների լայնածավալ նախագծման, շինարարության և շահագործման
                աշխատանքներում ոչ միայն Հայաստանում, այլ նաև դրա սահմաններից դուրս: Ֆակուլտետի շրջանավարտները
                գիտահետազոտական, նախագծման, շինարարական կազմակերպություններում, նախարարություններում զբաղեցնում են
                ղեկավար պաշտոններ, ունեն դոցենտի, պրոֆեսորի բարձր գիտական կոչումներ, Հայաստանի ազգային և այլ երկրների
                գիտությունների ակադեմիաների իսկական անդամներ են, նաև ստեղծագործական և պրոֆեսիոնալ միությունների
                անդամներ:
                Բարձր որակավորմամբ մասնագետներ պատրաստելու համար Շինարարության ֆակուլտետում ստեղծված են առավելագույն
                բարենպաստ պայմաններ:'
            ]
        ];
        return view('shinararutyun', ['data' => $this->data]);
    }

    public function qaxaqayin()
    {
        $this->data = [
            'heading' => 'Քաղաքային տնտեսության և էկոլոգիայի ֆակուլտետ',
            'accordions' => [
                [
                    'text' => 'Համալսարաններ',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Պատմություն',
                            'link_url' => '/history',
                        ],
                    ]
                ],
                [
                    'text' => 'Կառուցվածք',
                    'accordionTexts' => [
                        [
                            'anchor' => 'Ֆակուլտետներ',
                            'link_url' => '/',
                        ],
                    ]
                ],
            ],
            'paragraphs_under_heading' => [
                'Քաղաքային տնտեսության և էկոլոգիայի ֆակուլտետը Ճարտարապետության և շինարարության Հայաստանի ազգային համալսարանի կազմում հիմնադրվել է 2014 թվականից՝ ներառելով հետևյալ մասնագիտությունները՝'
            ],
            'lists' => [
                [
                    'italic' => '',
                    'content' => [
                        'Քաղաքային տնտեսություն և ջերմագազամատակարարում,',
                        'Փոխադրումների և ճանապարհային երթևեկության կազմակերպում և կառավարում',
                        'Անշարժ գույքի փորձաքննություն և կառավարում,',
                        'Անվտանգությունն արտակարգ իրավիճակներում,',
                        'Անվտանգությունն արտակարգ իրավիճակներում,',
                        'Բնապահպանական փորձաքննություն,',
                        'Թարգմանչական գործ (տեխնիկական թարգմանություն)՝ անգլերեն և հայերեն,',
                        'Թարգմանչական գործ (տեխնիկական թարգմանություն)՝ ռուսերեն և հայերեն:',
                    ],
                ],
                [
                    'italic' => 'Ներկայումս ֆակուլտետն իրականացնում է բակալավրի և մագիստրոսի կրթական աստիճաններով առկա և հեռակա ուսուցում՝ հետևյալ մասնագիտություններով ու կրթական ծրագրերով՝',
                    'content' => [
                        'Քաղաքային տնտեսություն,',
                    ]
                ],
                [
                    'italic' => 'Ջերմագազամատակարարում և օդափոխություն,',
                    'content' => [
                        'Տրանսպորտային համակարգեր,',
                    ]
                ],
            ],
            'secondary_paragraphs' => [
                'Քաղաքային տնտեսության և էկոլոգիայի ֆակուլտետի հինգ մասնագիտությամբ սովորում է շուրջ 350 ուսանող, որոնցից
                310-ը՝ բակալավրիատում, իսկ 40-ը՝ մագիստրատուրայում: Ասպիրանտուրայում սովորում է 4 ասպիրանտ, որոնցից 1-ը՝
                հայցորդ, 2-ը՝ դոկտորանտ:',
            ],
            'second_lists' => [
                [
                    'italic' => '<strong> Քաղաքային տնտեսության և էկոլոգիայի ֆակուլտետն ունի 6 ամբիոն՝</strong>,',
                    'content' => [
                        'Ջերմագազամատակարարման և օդափոխության,',
                        'Շինարարական մեքենաների և երթևեկության կազմակերպման,',
                        'Ջրային համակարգերի, հիդրոտեխնիկայի և հիդրոէներգետիկայի,',
                        'Գեոէկոլոգիայի և կենսաանվտանգության,',
                        'Ճարտարապետության տեսության, պատմաճատարապետական ժառանգության վերականգնման և վերակառուցման, գեղեցիկ արվեստի',
                        'Ֆիզկուլտուրայի'
                    ]
                ]
            ],
            'facultet_paragraphs' => [
                'Ֆակուլտետն իր գործունեության ընթացքում արտերկրի բուհերի հետ համալսարանի կնքած պայմանագրերի և համաձայնագրերի շրջանակում սերտ կապեր է հաստատել Ռոստովի պետական շինարարական և Հարավային դաշնային համալսարանների, Չեխիայի Հանրապետության Օստրավայի տեխնիկական համալսարանի, Վրաստանի տեխնիկական համալսարանի, Մոսկվայի պետական շինարարական համալսարանի, Ի. Մ. Գուբկինի անվան նավթի և գազի ՌԴ պետական համալսարանի, Գեոթինգենի Գեորգ Ավգուստ համալսարանի (Georg-August-University Göttingen) հետ, ինչի մասին փաստում են դասախոսների, ուսանողների և վարչական աշխատակազմի փոխայցելությունները, ուսանողների ու դասախոսների փոխանակման ծրագրերը և աշխատանքային հանդիպումները:',
                'ԱՊՀ երկրների համագործակցության շրջանակներում ֆակուլտետն ակտիվորեն մասնակցում է ԱՊՀ երկրների տրանսպորտային կոորդինացման խորհրդակցությանն առընթեր գիտության և կրթության խորհրդի միջճյուղային աշխատանքներին, որոնց նպատակն է ԱՊՀ երկրների միասնական տրանսպորտային համակարգի ինտեգրացումը:',
                'Ֆակուլտետի ամբիոնների գիտական գործունեությունը հիմնված է տարբեր ընկերությունների, կազմակերպությունների հետ ընդլայնված գործընկերային հարաբերությունների և համագործակցության սկզբունքների վրա, ինչը նպաստում է մարդկանց հետագա բարենպաստ կյանքին, մեծ նշանակություն ունեցող խնդիրների լուծմանը: Այդ առումով ֆակուլտետի ամբիոններում հետազոտական աշխատանքները ուսանողների ներգրավվածությամբ նպաստում են գիտելիքների, նորարարության և ստեղծագործության զարգացմանը, օրինակ՝ Ջերմագազամատակարարման և օդափոխության ամբիոնը մասնակցել է Ճարտարապետության և շինարարության Հայաստանի ազգային համալսարանի կողմից հայտարարված գիտահետազոտական աշխատանքների խրախուսման, ինչպես նաև դրանց իրականացմանը ուսանողների մասնակցությունն ապահովելու նպատակով հայտարարված դրամաշնորհների տրամադրման մրցույթին և դարձել հաղթողներից մեկը:',
                'Ուսանողների կրթական մակարդակի, նոր որակի, արտադրական և փորձագիտական հմտությունների կատարելագործման նպատակով ֆակուլտետի ենթակայության տակ գտնվող ամբիոններում պարբերաբար բացվում են նոր լաբորատորիաներ, որոնք հագեցած են ժամանակակից սարքավորումներով ու տեխնոլոգիաներով, որոնց շնորհիվ ուսանողն իր տեսական գիտելիքները գործնականում կիրառելու հնարավորություն է ստանում: Այդ է վկայում այն փաստը, որ ՀՀ բարձրագույն մասնագիտական կրթական ծրագրեր իրականացնող ուսումնական հաստատությունների լավագույն առաջադիմությամբ ուսանողների անվանական կրթաթոշակների տրամադրման մրցույթում ճարտարագիտության ոլորտում հաղթող է ճանաչվել մեր ֆակուլտետի ուսանողը:',
                '<strong>1972 թ.</strong> – սկսեց գործել ճարտարապետական-շինարարական մասնագիտությունների գծով թեկնածուական ատենախոսությունների պաշտպանության մասնագիտական խորհուրդը:',
                '<strong>2014 թ. հունվար</strong> –  Երևանի ճարտարապետության և շինարարության պետական համալսարանը վերանվանվեց Ճարտարապետության և շինարարության Հայաստանի ազգային համալսարան:',
                '<strong>2016թ.</strong> – նշվեց ճարտարապետության և շինարարության Հայաստանի ազգային համալսարանի 95-ամյա հոբելյանը, որին մասնակցեցին հանրապետության բուհերի ներկայացուցիչները, ԱՊՀ երկրների պատվիրակներ, հյուրեր ԱՄՆ-ից, Կանադայից, Ֆրանսիայից, Իտալիայից և այլ երկրներից:',
                '<strong>2019 թ.</strong> – ՃՇՀԱՀ հոգաբարձուների խորհուրդը ռեկտորի ժամանակավոր պաշտոնակատար ընտրեց տեխնիկական գիտությունների դոկտոր, պրոֆեսոր Եղիազար Վարդանյանին։',
                '<strong>2020 թ.</strong> –  հոգաբարձունների խորհրդի նիստում Ճարտարապետության և շինարարության Հայաստանի ազգային համալսարանի ռեկտոր ընտրվեց տեխնիկական գիտությունների դոկտոր, պրոֆեսոր Եղիազար Վարդանյանը։',
                '<strong>2021 թ.</strong> – Կայացավ «Պատմամշակութային ժառանգության պահպանությունը՝ որպես պետությունների միջև արդյունավետ երկխոսության միջոց» խորագրով միջազգային գիտաժողովը, որին մասնակցեց Ռուսաստանից, Ղազախստանից, Բելգիայից, Իտալիայից, Իսպանիայից, Ֆրանսիայից և մի շարք այլ երկրներից 65 ճարտարապետ գիտնական:',
                '<strong>2022 թ.</strong> – Հոգաբարձուների խորհրդի նախագահ ընտրվեց Քաղաքաշինության կոմիտեի նախագահ Արմեն Ղուլարյանը, իսկ քարտուղար՝ համալսարանի հայցորդ Խաչատուր Խաչատրյանը:',
            ],
        ];
        return view('qaxaqayin', ['data' => $this->data]);
    }

    public function facultet()
    {
        $this->data = [
            'slides' => [
                [
                    'image_url' => '/images/web.jpg',
                    'text' => 'Դիզայնի ֆակուլտետ',
                    'link_url' => '/design'
                ],
                [
                    'image_url' => '/images/arch.jpg',
                    'text' => 'Ճարտարապետության ֆակուլտետ',
                    'link_url' => '/architecture'
                ],
                [
                    'image_url' => '/images/econommy.jpg',
                    'text' => 'Շինարարության Ֆակուլտետ',
                    'link_url' => '/shinararutyun'
                ],
                [
                    'image_url' => '/images/economy.jpg',
                    'text' => 'Քաղաքային Տնտեսության և էկոլոգիայի ֆակուլտետ',
                    'link_url' => '/qaxaqayin'
                ]
            ],
            'accordions' => [
                [
                    'text' => 'Օդի կոնդիցիոնացում',
                    'accordionTexts' => [
                        [
                            'paragraph' =>
                                'Օդի կոնդիցիոնացման բազային դասընթացը նախատեսված է տվյալ ոլորտում աշխատող
                  մասնագետների համար: Օդի կոնդիցիոնացման համակարգերի ճշգրիտ նախագծման համար անհրաժեշտ է հասկանալ օդի
                  ջերմախոնավային մշակման տարբեր գործընթացները , տիրապետել I-d դիագրամի վրա պրոցեսների կառուցման
                  հմտություններին։ Կարևոր է նաև գիտելիքների ձեռքբերումը ուղղահոս, մեկ կամ երկու վերաշրջանառությամբ
                  համակարգերի նախագծման հիմունքների և առանձնահատկությունների վերաբերյալ։'

                        ],
                    ]
                ],
                [
                    'text' => 'ՋԵՌՈՒՑՈՒՄ',
                    'accordionTexts' => [
                        [
                            'paragraph' =>
                                'Ջեռուցման բազային դասընթացը նախատեսված է ջեռուցման համակարգերի նախագծման, մոնտաժման և սպասարկման
               ոլորտում ներգրավված մասնագետների համար: Մասնագետների համար կարևոր է տեսական և գործնական գիտելիքների
               ձեռքբերումը ջեռուցման համակարգերի տեսակների, դրանց դասակարգման, շենքի ջերմային հաշվեկշռի կազմման
               ելակետային տվյալների հավաքագրման, նախագծերի մշակման առանձնահատկությունների, սարքերի օպտիմալ ընտրության,
               համակարգի հիդրավլիկական հաշվարկի կատարման, ինչպես նաև ջեռուցման համակարգերի թողարկման, կարգաբերման և
               սպասարկման վերաբերյալ։'

                        ],
                    ]
                ],
                [
                    'text' => 'Autodesk Revit Architecture ՀԻՄՆԱԿԱՆ ԴԱՍԸՆԹԱՑ',
                    'accordionTexts' => [
                        [
                            'paragraph' =>
                ' Autodesk Revit ծրագրակազմը շինությունների տեղեկատվական մոդելավորման (BIM) նպատակով կիրառվող
                բազմաֆունկցիոնալ գործիք է։ Revit-ի միջոցով օպտիմալացվում է շինությունների նախագծման գործընթացը՝ շնորհիվ
                հիմնական 3D մոդելի, երբ մեկ տեսքում խմբագրումներն արտացոլվում են բոլոր այլ տեսքերում և տպվող
                փաստաթղթերում։'
                        ],
                    ]
                ],
            ],
        ];
        return view('facultet', ['data' => $this->data]);
    }
}
